# 5.1 Appending *pandas* Dataframes  
- *Appending* in pandas is stacking one dataframe (vertically) on top of another.  
- In order for that to work well, the columns in each dataframe should be the same in terms of: number, order, names, and data types.  
- A typical scenario for Appending is adding the most current time period of data to the end of past data.  
- Very often after we do that, we want to save the appended dataframe as a new file.  


- [Appending Dataframes](#Appending-Dataframes)   
- [Save Appended Dataframe as a csv file](#Save-Appended-Dataframe-as-a-csv-file)

In [1]:
import pandas as pd

### Read the data into the Dataframes

####  *mnth7_2011.csv*  

- Filename:  mnth7_2011.csv
- Number of Rows:   10
- Number of Columns:   6

In [3]:
#Read the csv file into a pandas dataframe
#Note: This file is in the Data folder underneath this folder 
df_mnth7_2011 = pd.read_csv('Data/mnth7_2011.csv')

print("Number of Rows:  ", df_mnth7_2011.shape[0])
print("Number of Columns:  ", df_mnth7_2011.shape[1])
df_mnth7_2011.head()

Number of Rows:   10
Number of Columns:   6

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242691897           2     99999999           90  02JUL2011     04JUL2011
1  1242736731           1       121107           10  07JUL2011     07JUL2011
2  1242773202           3     99999999           24  11JUL2011     14JUL2011
3  1242782701           3     99999999           27  12JUL2011     17JUL2011
4  1242827683           1       121105           10  17JUL2011     17JUL2011

####  *mnth8_2011.csv*  


- Filename:  mnth8_2011.csv
- Number of Rows:   12
- Number of Columns:   6

In [8]:
#Read the csv file into a pandas dataframe
#Note: This file is in the Data folder underneath this folder 
df_mnth8_2011 = pd.read_csv('Data/mnth8_2011.csv')

print("Number of Rows:  ", df_mnth8_2011.shape[0])
print("Number of Columns:  ", df_mnth8_2011.shape[1])
df_mnth8_2011.head()

Number of Rows:   12
Number of Columns:   6

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242977743           2     99999999           65  03AUG2011     07AUG2011
1  1243012144           2     99999999         2806  06AUG2011     10AUG2011
2  1243026971           1       120733           10  08AUG2011     08AUG2011
3  1243039354           1       120143           41  10AUG2011     10AUG2011
4  1243049938           3     99999999           53  11AUG2011     14AUG2011

# Appending Dataframes

### Append df_mnth8_2011 to df_mnth7_2011  
After appending should end up with:  
- Number of Rows:   10 + 12 = 22  
- Number of Columns:   6

In [4]:
# Append df_mnth8_2011 to df_mnth7_2011
df_Appended_8_2011 = df_mnth7_2011.append(df_mnth8_2011, ignore_index=True)

In [5]:
# Append check for df_Appended_8_2011
print("Number of Rows:  ", df_Appended_8_2011.shape[0])
print("Number of Columns:  ", df_Appended_8_2011.shape[1])

Number of Rows:   22
Number of Columns:   6

In [6]:
df_Appended_8_2011.head()

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242691897           2     99999999           90  02JUL2011     04JUL2011
1  1242736731           1       121107           10  07JUL2011     07JUL2011
2  1242773202           3     99999999           24  11JUL2011     14JUL2011
3  1242782701           3     99999999           27  12JUL2011     17JUL2011
4  1242827683           1       121105           10  17JUL2011     17JUL2011

# Save Appended Dataframe as a csv file  
- Saved data file: *mnth_current.csv*

In [9]:
# Display of number of rows and columns in the dataframe to doublecheck
print("Number of Rows:  ", df_Appended_8_2011.shape[0])
print("Number of Columns:  ", df_Appended_8_2011.shape[1])
df_Appended_8_2011.head(2)

Number of Rows:   22
Number of Columns:   6

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242691897           2     99999999           90  02JUL2011     04JUL2011
1  1242736731           1       121107           10  07JUL2011     07JUL2011

In [16]:
# Save the Dataframe to a csv file:  Don't include the index 
df_Appended_8_2011.to_csv("Data/mnth_current.csv", index=False)

In [17]:
# Test read the new csv file
df_test = pd.read_csv('Data/mnth_current.csv')

In [18]:
# Display of number of rows and columns in the dataframe to doublecheck
print("Number of Rows:  ", df_test.shape[0])
print("Number of Columns:  ", df_test.shape[1])
df_test.head(2)

Number of Rows:   22
Number of Columns:   6

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242691897           2     99999999           90  02JUL2011     04JUL2011
1  1242736731           1       121107           10  07JUL2011     07JUL2011